{
  "personalInfo": {
    "name": "Linden Hutchinson",
    "title": "Software Engineer (Full Stack)",
    "description": "Performance-driven Software Engineer specialising in backend architecture, security, and scalable systems. Expert in Python (Django, FastAPI) and PHP (Laravel), with a proven track record of optimising legacy codebases, automating CI/CD pipelines, and delivering high-impact solutions for government and SaaS platforms.",
    "image": "/resume/assets/images/me.jpg",
    "coverImage": "/resume/assets/images/cover_pic.jpg",
    "contact": {
      "email": "hutchinson.linden@gmail.com",
      "github": "https://github.com/lindenhutchinson",
      "linkedin": "https://www.linkedin.com/in/linden-hutchinson/",
      "location": "Melbourne"
    }
  },
  "experience": [
    {
      "company": "Sidekicker",
      "logo": "/resume/assets/logos/sidekicker-logo.png",
      "position": "Software Engineer",
      "location": "Melbourne",
      "duration": "May 2025 - Present",
      "type": "Full-time",
      "description": "Leading the optimisation of a core Laravel/Kohana platform, focusing on backend performance, observability, and modernising developer workflows.",
      "achievements": [
        "Developed features for a GraphQL API and React-based applications, ensuring seamless full-stack integration.",
        "Dramatically improved database performance by optimising a key SQL query, resulting in a 96% reduction in execution time.",
        "Conducted a thorough security audit of the codebase, identifying and remediating vulnerabilities to safeguard user data.",
        "Enhanced system observability by working with tools such as New Relic, Sentry and Grafana, enabling proactive identification of performance bottlenecks.",
        "Spearheaded new testing strategies and improved the Developer Experience (DevEx) for the testing suite, increasing deployment confidence.",
        "Partnered with stakeholders to translate business requirements into technical specifications, taking full ownership of feature development and bug remediation."
      ]
    },
    {
      "company": "Tesserent - Cyber Solutions by Thales",
      "logo": "/resume/assets/logos/tesserent-logo.jpg",
      "position": "Senior Software Developer",
      "location": "Melbourne",
      "duration": "March 2023 - May 2025",
      "type": "Full-time",
      "description": "Senior member of the software team developing high-security Python-based products for Australian Government clients and internal SaaS solutions.",
      "achievements": [
        "Triaged and resolved critical bugs in a legacy Django application, including a 6-month-old hidden issue; saved the development team 30 minutes of manual workaround time per day.",
        "Architected and built internal tools and APIs using a modern Python stack, including FastAPI, Django Ninja, and HTMX.",
        "Developed robust CI/CD pipelines with automated system builds and unit testing (Pytest) to ensure secure and reliable deployments.",
        "Led code reviews and technical mentorship, ensuring adherence to security best practices and high-quality coding standards.",
        "Architected an internal greenfield React application with complex multi-API integrations and high-security requirements."
      ]
    },
    {
      "company": "Hutchinson Software",
      "logo": "/resume/assets/logos/hutchinson-software-logo.jpg",
      "position": "Software Developer",
      "location": "Melbourne",
      "duration": "January 2019 - March 2023",
      "type": "Full-time",
      "description": "Focused on modernising legacy PHP environments and developing custom full-stack solutions for enterprise clients.",
      "achievements": [
        "Modernised a legacy PHP system by resolving core stability issues, significantly increasing system uptime and client satisfaction.",
        "Developed a bespoke Laravel application for event management, automating workflows and improving operational efficiency.",
        "Engineered a Vue.js data dashboard powered by a PHP REST API, implementing a comprehensive test suite using PHPUnit and Playwright.",
        "Optimised complex SQL queries across datasets involving millions of rows to maintain high application performance."
      ]
    }
  ],
  "education": [
    {
      "institution": "Deakin University",
      "logo": "/resume/assets/logos/deakin-uni-logo.jpg",
      "degree": "Bachelor of Artificial Intelligence",
      "location": "Melbourne",
      "duration": "2019 - 2022",
      "grade": "Distinction"
    }
  ],
  "skills": {
    "languages": {
      "title": "Languages",
      "items": [
        "Python",
        "PHP",
        "SQL",
        "JavaScript",
        "TypeScript",
        "HTML/CSS"
      ]
    },
    "frameworks": {
      "title": "Frameworks & Libraries",
      "items": [
        "Django",
        "FastAPI",
        "Laravel",
        "Django Ninja",
        "HTMX",
        "React",
        "Vue",
        "Node.js",
        "Ruby on Rails"
      ]
    },
    "tools": {
      "title": "Tools & Infrastructure",
      "items": [
        "Pytest",
        "PHPUnit",
        "Redis",
        "Docker",
        "CI/CD (GitHub Actions/GitLab)",
        "New Relic",
        "Grafana",
        "AWS",
        "GraphQL",
        "REST APIs",
        "Git"
      ]
    }
  },
  "projects": [
    {
      "title": "Real-Time Multiplayer Game",
      "description": "A real-time social deduction game utilising a modern Python backend. Built with Django Ninja for typed REST APIs and Django Channels/Redis for low-latency communication. Decoupled frontend using Alpine.js and containerised with Docker.",
      "link": "https://outlier-game.com",
      "date": "2025",
      "technologies": [
        "Python",
        "Django",
        "Django Ninja",
        "Channels",
        "Redis",
        "TypeScript",
        "Docker"
      ]
    }
  ],
  "publications": []
}